# Importing Dependencies & Data from PostgreSQL

In [1]:
# Dependencies
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
from config import password

In [2]:
# create database connection
engine = create_engine(f'postgresql://postgres:{password}@localhost/NYC_Eviction_DB')
db_connection = engine.connect()

In [3]:
# import eviction data from PostGres
eviction_data = pd.read_sql("SELECT executed_date, residential_commercial_ind, borough, eviction_zip FROM nyc_eviction_record", db_connection)
eviction_data["month"] = eviction_data["executed_date"].str.slice(0,2)
eviction_data["year"] = eviction_data["executed_date"].str.slice(6,12)
eviction_data.head()

  executed_date residential_commercial_ind   borough eviction_zip month  year
0    10/12/2018                Residential  BROOKLYN        11203    10  2018
1    12/10/2019                Residential  BROOKLYN        11208    12  2019
2    03/03/2020                Residential     BRONX        10466    03  2020
3    10/26/2017                Residential     BRONX        10458    10  2017
4    04/20/2018                Residential  BROOKLYN        11210    04  2018

# Performing ETL to export transformed Data to JSON format for faster Visualization

In [4]:
# group by borough data
borough_total_df = eviction_data.groupby( [ "year", "borough"] ).size().to_frame(name = 'total').reset_index()
# dropping rows beyond 2019
borough_total_df.drop(borough_total_df[borough_total_df['year'] >'2019'].index, inplace=True)
borough_total_df.head(20)

    year        borough  total
0   2017          BRONX   7662
1   2017       BROOKLYN   6357
2   2017      MANHATTAN   3452
3   2017         QUEENS   4325
4   2017  STATEN ISLAND    734
5   2018          BRONX   7140
6   2018       BROOKLYN   6157
7   2018      MANHATTAN   3390
8   2018         QUEENS   4452
9   2018  STATEN ISLAND    691
10  2019          BRONX   6188
11  2019       BROOKLYN   5312
12  2019      MANHATTAN   2806
13  2019         QUEENS   3705
14  2019  STATEN ISLAND    636

In [5]:
# convert data to json and saving in data folder
json = borough_total_df.to_json('static/data/borough_total.json', orient ='records')

In [6]:
# group by property data
property_total_df = eviction_data.groupby( [ "year", "residential_commercial_ind"] ).size().to_frame(name = 'total').reset_index()
# dropping rows beyond 2019
property_total_df.drop(property_total_df[property_total_df['year'] >'2019'].index, inplace=True)
property_total_df.head(20)

   year residential_commercial_ind  total
0  2017                 Commercial   1720
1  2017                Residential  20810
2  2018                 Commercial   1842
3  2018                Residential  19988
4  2019                 Commercial   1672
5  2019                Residential  16975

In [7]:
# convert data to json and saving in data folder
json = property_total_df.to_json('static/data/property_total.json', orient ='records')

In [8]:
# group by monthly borough data
borough_monthly_total_df = eviction_data.groupby( [ "borough", "year", "month"] ).size().to_frame(name = 'total').reset_index()
# dropping rows beyond 2019
borough_monthly_total_df.drop(borough_monthly_total_df[borough_monthly_total_df['year'] >'2019'].index, inplace=True)
borough_monthly_total_df.head(20)

   borough  year month  total
0    BRONX  2017    01    766
1    BRONX  2017    02    544
2    BRONX  2017    03    661
3    BRONX  2017    04    606
4    BRONX  2017    05    736
5    BRONX  2017    06    656
6    BRONX  2017    07    521
7    BRONX  2017    08    655
8    BRONX  2017    09    645
9    BRONX  2017    10    678
10   BRONX  2017    11    665
11   BRONX  2017    12    529
12   BRONX  2018    01    840
13   BRONX  2018    02    623
14   BRONX  2018    03    532
15   BRONX  2018    04    604
16   BRONX  2018    05    750
17   BRONX  2018    06    640
18   BRONX  2018    07    593
19   BRONX  2018    08    642

In [9]:
# convert data to json and saving in data folder
json = borough_monthly_total_df.to_json('static/data/yearoveryear_total.json', orient ='records')

In [10]:
# group by zip data
zip_total_df = eviction_data.groupby( [ "eviction_zip", "year" ] ).size().to_frame(name = 'total').reset_index()
# dropping rows beyond 2019
zip_total_df.drop(zip_total_df[zip_total_df['year'] >'2019'].index, inplace=True)
# dropping wrong zipcodes
zip_total_df.drop(zip_total_df[zip_total_df['eviction_zip'] < '00501'].index, inplace=True)
zip_total_df.drop(zip_total_df[zip_total_df['eviction_zip'] > '14925'].index, inplace=True)
zip_total_df.drop(zip_total_df[zip_total_df['eviction_zip'] == '01000'].index, inplace=True)
zip_total_df.head(20)

   eviction_zip  year  total
2         10000  2019      1
3         10001  2017    108
4         10001  2018    144
5         10001  2019     84
7         10002  2017    114
8         10002  2018    110
9         10002  2019     82
11        10003  2017     55
12        10003  2018     48
13        10003  2019     44
15        10004  2017      8
16        10004  2018      6
17        10004  2019      8
19        10005  2017     16
20        10005  2018     14
21        10005  2019     17
23        10006  2017      9
24        10006  2018      8
25        10006  2019      7
27        10007  2017      9

In [11]:
# convert data to json and saving in data folder
json = zip_total_df.to_json('static/data/zipcode_total.json', orient ='records')

# Integrating Zipcode JSON with Latitude / Longitude JSON to prepare Data for the Leaflet Map

In [12]:
# Importing Lat / Long data from csv to  DataFrame
csv_file = "static/data/NY-state-zip-code-latitude-and-longitude.csv"
pincode_df = pd.read_csv(csv_file, sep=";")
pincode_df.head()

,Zip,City,State,Latitude,Longitude,Timezone,Daylight savings time flag,geopoint
0,13224,Syracuse,NY,43.041866,-76.103200,-5,1,"43.041866,-76.1032"
1,13782,Hamden,NY,42.189420,-74.992190,-5,1,"42.18942,-74.99219"
2,12144,Rensselaer,NY,42.637380,-73.725870,-5,1,"42.63738,-73.72587"
3,11555,Uniondale,NY,40.754757,-73.601772,-5,1,"40.754757,-73.601772"
4,11558,Island Park,NY,40.603159,-73.655150,-5,1,"40.603159,-73.65515"

In [13]:
# Selecting only the columns that are needed to prepare the map
pin_coord_df = pincode_df[["Zip", "Latitude", "Longitude"]].copy()
pin_coord_df.head(10)

     Zip   Latitude  Longitude
0  13224  43.041866 -76.103200
1  13782  42.189420 -74.992190
2  12144  42.637380 -73.725870
3  11555  40.754757 -73.601772
4  11558  40.603159 -73.655150
5  10117  40.780751 -73.977182
6  11575  40.679413 -73.586940
7  11789  40.955586 -72.973300
8  14646  43.286024 -77.684264
9  11735  40.725968 -73.441510

In [14]:
# Creating clean dataframe from the zipcode json
json_file = "static/data/zipcode_total.json"
eviction_zip_df = pd.read_json(json_file)
eviction_zip_df.head()

   eviction_zip  year  total
0         10000  2019      1
1         10001  2017    108
2         10001  2018    144
3         10001  2019     84
4         10002  2017    114

In [15]:
# Combine zipcode dataframe with lat-lang dataframe
combined_df = pd.merge(pin_coord_df, eviction_zip_df, left_on="Zip", right_on="eviction_zip")
combined_df.head()

     Zip   Latitude  Longitude  eviction_zip  year  total
0  11575  40.679413 -73.586940         11575  2019      2
1  11109  40.651378 -73.870779         11109  2017     10
2  11109  40.651378 -73.870779         11109  2018     14
3  11109  40.651378 -73.870779         11109  2019      9
4  11229  40.599256 -73.941180         11229  2017     91

In [16]:
# convert data to json and saving in data folder
json = combined_df.to_json('static/data/combined_zip.json', orient ='records')